#include <iostream>
using namespace std;


int main()

{
    setlocale(LC_ALL, "RUS");
    int n;
    cin >> n;
    if (n / 1000000 == 9) {
        cout << "девять милионов ";
    }
    if (n / 1000000 == 8) {
        cout << "восемь милионов ";
    }
    if (n / 1000000 == 7) {
        cout << "семь милионов ";
    }
    if (n / 1000000 == 6) {
        cout << "вшесть милионов ";
    }
    if (n / 1000000 == 5) {
        cout << "пять милионов ";
    }
    if (n / 1000000 == 4) {
        cout << "четыре милиона ";
    }
    if (n / 1000000 == 3) {
        cout << "три милиона ";
    }
    if (n / 1000000 == 2) {
        cout << "два милиона ";
    }
    if (n / 1000000 == 1) {
        cout << "один милион ";
    }




    n = n % 1000000;
    int t = 0;
    if (n / 1000 > 0) {
        t = 1;
    }



    if (n / 100000 == 9) {
        cout << "девятьсот ";
    }
    if (n / 100000 == 8) {
        cout << "восемьсот ";
    }
    if (n / 100000 == 7) {
        cout << "семьсот ";
    }
    if (n / 100000 == 6) {
        cout << "шестьсот ";
    }
    if (n / 100000 == 5) {
        cout << "пятьсот ";
    }
    if (n / 100000 == 4) {
        cout << "четыреста ";
    }
    if (n / 100000 == 3) {
        cout << "триста ";
    }
    if (n / 100000 == 2) {
        cout << "двести ";
    }
    if (n / 100000 == 1) {
        cout << "сто ";
    }


    n = n % 100000;



    if (n / 10000 == 9) {
        cout << "девяносто ";
    }
    if (n / 10000 == 8) {
        cout << "восемьдесят ";
    }
    if (n / 10000 == 7) {
        cout << "семьдесят ";
    }

    if (n / 10000 == 6) {
        cout << "шестьдесят ";
    }
    if (n / 10000 == 5) {
        cout << "пятьдесят ";
    }

    if (n / 10000 == 4) {
        cout << "сорок ";
    }
    if (n / 10000 == 3) {
        cout << "тридцать ";
    }
    if (n / 10000 == 2) {
        cout << "двадцать ";
    }
    if (n / 1000 == 10)
        cout << "десять тысяч ";
    if (n / 10000 != 1)
        n = n % 10000;
    // if (n / 1000 == 10)
       //  cout << "десять  ";

    if (n / 1000 == 11)
        cout << "одиннадцать тысяч ";
    if (n / 1000 == 12)
        cout << "двенадцать тысяч ";
    if (n / 1000 == 13)
        cout << "тринадцать тысяч ";
    if (n / 1000 == 14)
        cout << "четырнадцать тысяч ";
    if (n / 1000 == 15)
        cout << "пятнадцать тысяч ";
    if (n / 1000 == 16)
        cout << "шестнадцать тысяч ";
    if (n / 1000 == 17)
        cout << "семнадцать тысяч ";
    if (n / 1000 == 18)
        cout << "восемнадцать тысяч ";
    if (n / 1000 == 19)
        cout << "девятнадцать тысяч ";

    if (n / 1000 == 1) {
        cout << "одна тысяча ";
    }
    if (n / 1000 == 2) {
        cout << "две тысячи ";
    }
    if (n / 1000 == 3) {
        cout << "три тысячи ";
    }
    if (n / 1000 == 4) {
        cout << "четыре тысячи ";
    }
    if (n / 1000 == 5) {
        cout << "пять тысяч ";
    }
    if (n / 1000 == 6) {
        cout << "шесть тысяч ";
    }
    if (n / 1000 == 7) {
        cout << "семь тысяч ";
    }
    if (n / 1000 == 8) {
        cout << "восемь тысяч ";
    }
    if (n / 1000 == 9) {
        cout << "девять тысяч ";
    }

    if (n / 1000 == 0 && t == 1)
        cout << "тысяч ";


    n = n % 1000;
    if (n / 100 == 9) {
        cout << "девятьсот ";
    }
    if (n / 100 == 8) {
        cout << "восемьсот ";
    }
    if (n / 100 == 7) {
        cout << "семьсот ";
    }
    if (n / 100 == 6) {
        cout << "шестьсот ";
    }
    if (n / 100 == 5) {
        cout << "пятьсот ";
    }
    if (n / 100 == 4) {
        cout << "четыреста ";
    }
    if (n / 100 == 3) {
        cout << "триста ";
    }
    if (n / 100 == 2) {
        cout << "двести ";
    }
    if (n / 100 == 1) {
        cout << "сто ";
    }


    n = n % 100;



    if (n / 10 == 9) {
        cout << "девяносто ";
    }
    if (n / 10 == 8) {
        cout << "восемьдесят ";
    }
    if (n / 10 == 7) {
        cout << "семьдесят ";
    }

    if (n / 10 == 6) {
        cout << "шестьдесят ";
    }
    if (n / 10 == 5) {
        cout << "пятьдесят ";
    }

    if (n / 10 == 4) {
        cout << "сорок ";
    }
    if (n / 10 == 3) {
        cout << "тридцать ";
    }
    if (n / 10 == 2) {
        cout << "двадцать ";
    }
    if (n / 10 != 1)
        n = n % 10;
    if (n == 1)
        cout << "один";
    if (n == 2)
        cout << "два";
    if (n == 3)
        cout << "три";
    if (n == 4)
        cout << "четыре";
    if (n == 5)
        cout << "пять";
    if (n == 6)
        cout << "шесть";
    if (n == 7)
        cout << "семь";
    if (n == 8)
        cout << "восемь";
    if (n == 9)
        cout << "девять";
    if (n == 10)
        cout << "десять";
    if (n == 11)
        cout << "одиннадцать";
    if (n == 12)
        cout << "двенадцать";
    if (n == 13)
        cout << "тринадцать";
    if (n == 14)
        cout << "четырнадцать";
    if (n == 15)
        cout << "пятнадцать";
    if (n == 16)
        cout << "шестнадцать";
    if (n == 17)
        cout << "семнадцать";
    if (n == 18)
        cout << "восемнадцать";
    if (n == 19)
        cout << "девятнадцать";







}
