#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int m;
	int x = 0;
	int d;
	int n;
	int p = 0;
	cin >> m;
	cin >> d;
	if (m == 1)
		x = d;
	if (m == 2)
		x = d + 31;
	if (m == 3)
		x = d + 31 + 28;
	if (m == 4)
		x = d + 31 + 28 + 31;
	if (m == 5)
		x = d + 31 + 28 + 31 + 30;
	if (m == 6)
		x = d + 31 + 28 + 31 + 30 + 31;
	if (m == 7)
		x = d + 31 + 28 + 31 + 30 + 31 + 30;
	if (m == 8)
		x = d + 31 + 28 + 31 + 30 + 31 + 30 + 31;
	if (m == 9)
		x = d + 31 + 28 + 31 + 30 + 31 + 30 + 31 + 31;
	if (m == 10)
		x = d + 31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30;
	if (m == 11)
		x = d + 31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31;
	if (m == 12)
		x = d + 31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30;
	n = 365 - x;
	if (m > 12 || m < 1)
		cout << "ошибка";
	else {
		if ((m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12) && (d < 32 && d > 0))
		{
			cout << n;
			p = 1;
		}
		if ((m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12) && (d < 1 || d > 31))
		{
			cout << "ошибка";
		}
		if ((m == 4 || m == 6 || m == 9 || m == 11) && (d < 31 && d > 0))
		{

			cout << n;
		}
		if ((m == 4 || m == 6 || m == 9 || m == 11) && (d < 1 || d > 30))
		{

			cout << "ошибка";
		}
		if ((m == 2) && (d < 29 && d >0))
			cout << n;
		if ((m == 2) && (d < 1 || d >28))

			cout << "ошибка";
	}
	return(0);
}

